package com.test.main;

public class Main {
    public static void main(String[] args){
        // 식별자
        // 프로그래밍 언어에서 개발자가 만들어 사용하는 요소들을 구분하기 위해 붙여주는 이름
        // 1. 길이에 제한이 없다.
        // 2. 첫 글자는 문자, _, $ 만 가능하다.
        // 3. 두 번째 글자 부터는 숫자, 문자, _, $ 를 사용할 수 있다.
        // 4. 한글로도 가능하다.

        // 자바에서의 권장사항 (Naming Convention)
        // 1. 변수는 첫 글자를 소문자로 한다.
        // 2. 메서드는 첫 글자를 소문자로 한다.
        // 3. 클래스는 첫 글자를 대문자로 한다.
        // 4. 상수를 의미하는 것들은 모두 대문자로 작성한다.

        // 파스칼 표기 기법
        // 1. 단어와 단어 사이에 언더바(_)를 두는 표기 기법
        // 2. korean_point_avg
        // 3. 자바에서는 상수를 표현할 때 쓰인다.

        // 카멜 표기 기법
        // 1. 각 단어의 첫 글자를 대문자로 작성하는 표기 기법
        // 2. koreanPointAvg
        // 3. 자바에서는 상수 외의 모든 것들을 표현할 때 쓰인다.
    }
}
